EJERCICIO SQL CERVEZAS

1. Obtener el nombre  de los empleados que hayan repartido al bar Stop durante la semana 
del 17 al 23 de octubre de 2005. 
2. Obtener el Cif y nombre de los bares a los que se ha repartido cerveza de tipo Botella y 
capacidad inferior a 1 litro, ordenados por localidad 
3. Obtener los repartos (nombre del bar, envase y capacidad de la bebida, fecha y cantidad) 
4. Obtener los bares a los que se les ha repartido envases de tipo botella y capacidad 0.2 ó 
0.33 
5. Nombre de los empleados que han repartido a los bares "Stop" y "Las Vegas" cervezas con 
envase botella. 
6. Obtener el nombre y número de viajes que ha realizado cada empleado fuera de Villa 
Botijo. 
7. Obtener el nombre y localidad del bar que más litros de cerveza ha comprado.  
8. Obtener los bares que han adquirido todos los tipos de cerveza con envase de botella y 
capacidad menor que 1 litro.  
9. Subir un 5% el sueldo del empleado que más días haya trabajado.

Obtener el nombre  de los empleados que hayan repartido al bar Stop durante la semana del 17 al 23 de octubre de 2005.

In [ ]:
cursor.execute('''
SELECT DISTINCT E.Nombre
FROM Empleados E
JOIN Reparto R ON E.CodE = R.CodE
JOIN Bares B ON R.CodB = B.CodB
WHERE B.Nombre = 'Stop'
  AND R.Fecha BETWEEN '10/17/05' AND '10/23/05'
''')

NameError: name 'cursor' is not defined

Obtener el Cif y nombre de los bares a los que se ha repartido cerveza de tipo Botella y 
# capacidad inferior a 1 litro, ordenados por localidad

In [ ]:
cursor.execute('''
SELECT DISTINCT B.Cif, B.Nombre
FROM Bares B
JOIN Reparto R ON B.CodB = R.CodB
JOIN Envase E ON R.CodC = E.CodC
WHERE E.Tipo = 'Botella'
  AND E.Capacidad < 1
ORDER BY B.Localidad
''')

[('33333333Z', 'Otra Ronda'), ('11111111X', 'Stop')]

SELECT DISTINCT B.Cif, B.Nombre: seleccionamos el CIF y el nombre de los bares, sin duplicados.

FROM Bares B JOIN Reparto R ON B.CodB = R.CodB JOIN Envase E ON R.CodC = E.CodC: hacemos joins para relacionar los bares con los repartos y los envases que se entregaron.

WHERE E.Tipo = 'Botella' AND E.Capacidad < 1: filtramos solo los repartos de cervezas tipo Botella y con capacidad menor a 1 litro.

ORDER BY B.Localidad: ordenamos los resultados por la localidad del bar para verlos organizados geográficamente.

El resultado será una lista de bares que recibieron botellas pequeñas de cerveza, mostrando su CIF y nombre, ordenados por localidad.

Tabla empleados

In [ ]:
cursor.executescript("""
CREATE TABLE Empleados (CodE INTEGER PRIMARY KEY, Nombre TEXT, Sueldo REAL);
INSERT INTO Empleados (CodE, Nombre, Sueldo)
VALUES (1,'Juan',120000),(2,'Ana',110000),(3,'Luis',100000);
""")

Tabla Bares

In [ ]:
cursor.execute('''CREATE TABLE Bares (CodB TEXT PRIMARY KEY,Nombre TEXT, Cif TEXT,Localidad TEX)
''')
cursor.executemany('''INSERT INTO Bares (CodB, Nombre, Cif, Localidad) VALUES (?, ?, ?, ?)''', [
    ('001', 'Stop', '11111111X', 'Villa Botijo'),
    ('002', 'Las Vegas', '22222222Y', 'Villa Botijo'),
    ('003', 'Club Social', None, 'Las Ranas'),
    ('004', 'Otra Ronda', '33333333Z', 'La Esponja')])

Tabla Envase

In [ ]:
cursor.execute('''
CREATE TABLE Envase (
    CodC TEXT PRIMARY KEY,
    Tipo TEXT,
    Capacidad REAL,
    Stock INTEGER
)
''')
cursor.executemany('''
INSERT INTO Envase (CodC, Tipo, Capacidad, Stock) VALUES (?, ?, ?, ?)
''', [
    ('01', 'Botella', 0.2, 3600),
    ('02', 'Botella', 0.33, 1200),
    ('03', 'Lata', 0.33, 2400),
    ('04', 'Botella', 1, 288),
    ('05', 'Barril', 60, 30)])

Tabla Reparto

In [ ]:
cursor.execute('''
CREATE TABLE Reparto (CodE INTEGER,CodB TEXT, CodC TEXT, Fecha TEXT, Cantidad INTEGER, FOREIGN KEY (CodE) REFERENCES Empleados(CodE), FOREIGN KEY (CodB) REFERENCES Bares(CodB),FOREIGN KEY (CodC) REFERENCES Envase(CodC)
)
''')
cursor.executemany('''INSERT INTO Reparto (CodE, CodB, CodC, Fecha, Cantidad) VALUES (?, ?, ?, ?, ?)
''', [
    (1, '001', '01', '10/21/05', 240),
    (1, '001', '02', '10/21/05', 48),
    (1, '002', '03', '10/22/05', 60),
    (1, '004', '05', '10/22/05', 4),
    (2, '002', '03', '10/22/05', 48),
    (2, '002', '05', '10/23/05', 2),
    (2, '004', '01', '10/23/05', 480),
    (2, '004', '02', '10/24/05', 72),
    (3, '003', '03', '10/24/05', 48),
    (3, '003', '04', '10/25/05', 20)])

cnx.commit()

Obtener los repartos (nombre del bar, envase y capacidad de la bebida, fecha y cantidad)

In [ ]:
cursor.execute('''
SELECT B.Nombre AS Bar, E.Tipo AS Envase, E.Capacidad, R.Fecha, R.Cantidad
FROM Reparto R
JOIN Bares B ON R.CodB = B.CodB
JOIN Envase E ON R.CodC = E.CodC
''')

[('Stop', 'Botella', 0.2, '10/21/05', 240), ('Stop', 'Botella', 0.33, '10/21/05', 48), ('Las Vegas', 'Lata', 0.33, '10/22/05', 60), ('Otra Ronda', 'Barril', 60.0, '10/22/05', 4), ('Las Vegas', 'Lata', 0.33, '10/22/05', 48), ('Las Vegas', 'Barril', 60.0, '10/23/05', 2), ('Otra Ronda', 'Botella', 0.2, '10/23/05', 480), ('Otra Ronda', 'Botella', 0.33, '10/24/05', 72), ('Club Social', 'Lata', 0.33, '10/24/05', 48), ('Club Social', 'Botella', 1.0, '10/25/05', 20)]

In [ ]:
print(cursor.fetchall())

------------------------------
Bar: Stop
Envase: Botella
Capacidad: 0.2
Fecha: 10/21/05
Cantidad: 240
------------------------------
Bar: Stop
Envase: Botella
Capacidad: 0.33
Fecha: 10/21/05
Cantidad: 48
------------------------------
Bar: Las Vegas
Envase: Lata
Capacidad: 0.33
Fecha: 10/22/05
Cantidad: 60
------------------------------
Bar: Otra Ronda
Envase: Barril
Capacidad: 60.0
Fecha: 10/22/05
Cantidad: 4
------------------------------
Bar: Las Vegas
Envase: Lata
Capacidad: 0.33
Fecha: 10/22/05
Cantidad: 48
------------------------------
Bar: Las Vegas
Envase: Barril
Capacidad: 60.0
Fecha: 10/23/05
Cantidad: 2
------------------------------
Bar: Otra Ronda
Envase: Botella
Capacidad: 0.2
Fecha: 10/23/05
Cantidad: 480
------------------------------
Bar: Otra Ronda
Envase: Botella
Capacidad: 0.33
Fecha: 10/24/05
Cantidad: 72
------------------------------
Bar: Club Social
Envase: Lata
Capacidad: 0.33
Fecha: 10/24/05
Cantidad: 48
------------------------------
Bar: Club Social
Envase: Botella
Capacidad: 1.0
Fecha: 10/25/05
Cantidad: 20

bares a los que se les ha repartido envases de tipo botella y capacidad 0.2 ó 0.33

In [ ]:

cursor.execute('''
SELECT DISTINCT B.Nombre AS Bar
FROM Reparto R
JOIN Bares B ON R.CodB = B.CodB
JOIN Envase E ON R.CodC = E.CodC
WHERE E.Tipo = 'Botella'
  AND E.Capacidad IN (0.2, 0.33)
''')

Bares que recibieron botellas de 0.2 o 0.33 litros:
- Stop
- Otra Ronda

Nombre de los empleados que han repartido a los bares "Stop" y "Las Vegas" cervezas con envase botella.

In [ ]:
cursor.execute('''
SELECT DISTINCT E.Nombre
FROM Empleados E
JOIN Reparto R ON E.CodE = R.CodE
JOIN Bares B ON R.CodB = B.CodB
JOIN Envase C ON R.CodC = C.CodC
WHERE B.Nombre IN ('Stop', 'Las Vegas')
  AND C.Tipo = 'Botella'
''')

Empleados que repartieron botellas a 'Stop' y 'Las Vegas':
- Juan

Obtener el nombre y número de viajes que ha realizado cada empleado fuera de Villa Botijo.

In [ ]:
cursor.execute('''
SELECT E.Nombre, COUNT(*) AS NumViajes
FROM Empleados E
JOIN Reparto R ON E.CodE = R.CodE
JOIN Bares B ON R.CodB = B.CodB
WHERE B.Localidad != 'Villa Botijo'
GROUP BY E.Nombre
''')

Número de viajes de cada empleado fuera de Villa Botijo:
- Ana: 2 viaje(s)
- Juan: 1 viaje(s)
- Luis: 2 viaje(s)

Obtener el nombre y localidad del bar que más litros de cerveza ha comprado.

In [ ]:
cursor.execute('''
SELECT B.Nombre AS Bar, B.Localidad, SUM(E.Capacidad * R.Cantidad) AS Litros
FROM Reparto R
JOIN Bares B ON R.CodB = B.CodB
JOIN Envase E ON R.CodC = E.CodC
GROUP BY B.CodB
ORDER BY Litros DESC
LIMIT 1
''')

Bar que más litros ha comprado:
- Bar: Otra Ronda
- Localidad: La Esponja
- Litros totales: 359.76

Obtener los bares que han adquirido todos los tipos de cerveza con envase de botella y capacidad menor que 1 litro.

In [ ]:
cursor.execute('''
SELECT B.Nombre
FROM Bares B
WHERE NOT EXISTS (
    SELECT *
    FROM Envase E
    WHERE E.Tipo = 'Botella' AND E.Capacidad < 1
      AND NOT EXISTS (
          SELECT *
          FROM Reparto R
          WHERE R.CodB = B.CodB AND R.CodC = E.CodC
      )
)
''')

Bares que adquirieron todos los tipos de botellas < 1 litro:
- Stop
- Otra Ronda

 Encontrar el empleado con más días trabajados

In [ ]:
cursor.execute('''
SELECT E.CodE
FROM Empleados E
JOIN Reparto R ON E.CodE = R.CodE
GROUP BY E.CodE
ORDER BY COUNT(DISTINCT R.Fecha) DESC
LIMIT 1
''')

In [ ]:
empleado = cursor.fetchone()[0]

sueldo + un 5%

In [ ]:
cursor.execute('''
UPDATE Empleados
SET Sueldo = Sueldo * 1.05
WHERE nombre = "Rosa Perez"
''', (empleado,))